# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [2]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib

%matplotlib inline

In [3]:
mi_df = pd.read_json('data/data-demo-5.json')

In [4]:
mi_df

    nombres apellidos    edad
0      rené  elizalde     NaN
1   enrique     cueva     NaN
2    carlos  castillo  edad12
3     pedro   salinas  edad13
4  cristian   andrade  edad14

In [5]:
mi_df = mi_df.dropna()

In [6]:
mi_df.fillna(0)

    nombres apellidos    edad
2    carlos  castillo  edad12
3     pedro   salinas  edad13
4  cristian   andrade  edad14